commit e425ac99b1573692fc4bb5bda1040caccb127490
Author: Alexander Aring <aahringo@redhat.com>
Date:   Thu Apr 7 10:45:42 2022 -0400

    fs: dlm: cast resource pointer to uintptr_t
    
    This patch fixes the following warning when doing a 32 bit kernel build
    when pointers are 4 byte long:
    
    In file included from ./include/linux/byteorder/little_endian.h:5,
                     from ./arch/x86/include/uapi/asm/byteorder.h:5,
                     from ./include/asm-generic/qrwlock_types.h:6,
                     from ./arch/x86/include/asm/spinlock_types.h:7,
                     from ./include/linux/spinlock_types_raw.h:7,
                     from ./include/linux/ratelimit_types.h:7,
                     from ./include/linux/printk.h:10,
                     from ./include/asm-generic/bug.h:22,
                     from ./arch/x86/include/asm/bug.h:87,
                     from ./include/linux/bug.h:5,
                     from ./include/linux/mmdebug.h:5,
                     from ./include/linux/gfp.h:5,
                     from ./include/linux/slab.h:15,
                     from fs/dlm/dlm_internal.h:19,
                     from fs/dlm/rcom.c:12:
    fs/dlm/rcom.c: In function ‘dlm_send_rcom_lock’:
    ./include/uapi/linux/byteorder/little_endian.h:32:43: warning: cast from pointer to integer of different size [-Wpointer-to-int-cast]
     #define __cpu_to_le64(x) ((__force __le64)(__u64)(x))
                                               ^

    leds: Add missing include for leds.h
    
    This patch has added #include <linux/spinlock.h> to include/linux/leds.h
    for rwlock_t.
    
    Signed-off-by: Yoichi Yuasa <yoichi_yuasa@tripeaks.co.jp>
    Signed-off-by: Richard Purdie <rpurdie@rpsys.net>

commit 4fe87745a6722d42ff27a60768c77958fa1fc498
Author: Peter Zijlstra <a.p.zijlstra@chello.nl>
Date:   Thu Jul 19 01:48:58 2007 -0700

    lockstat: hook into spinlock_t, rwlock_t, rwsem and mutex
    
    Call the new lockstat tracking functions from the various lock primitives.
    
    Signed-off-by: Peter Zijlstra <a.p.zijlstra@chello.nl>
    Acked-by: Ingo Molnar <mingo@elte.hu>
    Acked-by: Jason Baron <jbaron@redhat.com>
    Signed-off-by: Andrew Morton <akpm@linux-foundation.org>
    Signed-off-by: Linus Torvalds <torvalds@linux-foundation.org>

commit dbca9b2750e3b1ee6f56a616160ccfc12e8b161f
Author: Eric Dumazet <dada1@cosmosbay.com>
Date:   Thu Feb 8 14:16:46 2007 -0800

    [NET]: change layout of ehash table
    
    ehash table layout is currently this one :
    
    First half of this table is used by sockets not in TIME_WAIT state
    Second half of it is used by sockets in TIME_WAIT state.
    
    This is non optimal because of for a given hash or socket, the two chain heads
    are located in separate cache lines.
    Moreover the locks of the second half are never used.
    
    If instead of this halving, we use two list heads in inet_ehash_bucket instead
    of only one, we probably can avoid one cache miss, and reduce ram usage,
    particularly if sizeof(rwlock_t) is big (various CONFIG_DEBUG_SPINLOCK,
    CONFIG_DEBUG_LOCK_ALLOC settings). So we still halves the table but we keep
    together related chains to speedup lookups and socket state change.
    
    In this patch I did not try to align struct inet_ehash_bucket, but a future
    patch could try to make this structure have a convenient size (a power of two
    or a multiple of L1_CACHE_SIZE).
    I guess rwlock will just vanish as soon as RCU is plugged into ehash :) , so
    maybe we dont need to scratch our heads to align the bucket...
    
    Note : In case struct inet_ehash_bucket is not a power of two, we could
    probably change alloc_large_system_hash() (in case it use __get_free_pages())
    to free the unused space. It currently allocates a big zone, but the last
    quarter of it could be freed. Again, this should be a temporary 'problem'.
    
    Patch tested on ipv4 tcp only, but should be OK for IPV6 and DCCP.
    
    Signed-off-by: Eric Dumazet <dada1@cosmosbay.com>
    Signed-off-by: David S. Miller <davem@davemloft.net>

commit 36de6437866bbb1d37e2312ff4f95ee4ed6d2b61
Author: Arnaldo Carvalho de Melo <acme@mandriva.com>
Date:   Wed Dec 6 20:33:42 2006 -0800

    [PATCH] Save some bytes in struct mm_struct
    
    Before:
    [acme@newtoy net-2.6.20]$ pahole --cacheline 32 kernel/sched.o mm_struct
    
    /* include2/asm/processor.h:542 */
    struct mm_struct {
            struct vm_area_struct *    mmap;                 /*     0     4 */
            struct rb_root             mm_rb;                /*     4     4 */
            struct vm_area_struct *    mmap_cache;           /*     8     4 */
            long unsigned int          (*get_unmapped_area)(); /*    12     4 */
            void                       (*unmap_area)();      /*    16     4 */
            long unsigned int          mmap_base;            /*    20     4 */
            long unsigned int          task_size;            /*    24     4 */
            long unsigned int          cached_hole_size;     /*    28     4 */
            /* ---------- cacheline 1 boundary ---------- */
            long unsigned int          free_area_cache;      /*    32     4 */
            pgd_t *                    pgd;                  /*    36     4 */
            atomic_t                   mm_users;             /*    40     4 */
            atomic_t                   mm_count;             /*    44     4 */
            int                        map_count;            /*    48     4 */
            struct rw_semaphore        mmap_sem;             /*    52    64 */
            spinlock_t                 page_table_lock;      /*   116    40 */
            struct list_head           mmlist;               /*   156     8 */
            mm_counter_t               _file_rss;            /*   164     4 */
            mm_counter_t               _anon_rss;            /*   168     4 */
            long unsigned int          hiwater_rss;          /*   172     4 */
            long unsigned int          hiwater_vm;           /*   176     4 */
            long unsigned int          total_vm;             /*   180     4 */
            long unsigned int          locked_vm;            /*   184     4 */
            long unsigned int          shared_vm;            /*   188     4 */
            /* ---------- cacheline 6 boundary ---------- */
            long unsigned int          exec_vm;              /*   192     4 */
            long unsigned int          stack_vm;             /*   196     4 */
            long unsigned int          reserved_vm;          /*   200     4 */
            long unsigned int          def_flags;            /*   204     4 */
            long unsigned int          nr_ptes;              /*   208     4 */
            long unsigned int          start_code;           /*   212     4 */
            long unsigned int          end_code;             /*   216     4 */
            long unsigned int          start_data;           /*   220     4 */
            /* ---------- cacheline 7 boundary ---------- */
            long unsigned int          end_data;             /*   224     4 */
            long unsigned int          start_brk;            /*   228     4 */
            long unsigned int          brk;                  /*   232     4 */
            long unsigned int          start_stack;          /*   236     4 */
            long unsigned int          arg_start;            /*   240     4 */
            long unsigned int          arg_end;              /*   244     4 */
            long unsigned int          env_start;            /*   248     4 */
            long unsigned int          env_end;              /*   252     4 */
            /* ---------- cacheline 8 boundary ---------- */
            long unsigned int          saved_auxv[44];       /*   256   176 */
            unsigned int               dumpable:2;           /*   432     4 */
            cpumask_t                  cpu_vm_mask;          /*   436     4 */
            mm_context_t               context;              /*   440    68 */
            long unsigned int          swap_token_time;      /*   508     4 */
            /* ---------- cacheline 16 boundary ---------- */
            char                       recent_pagein;        /*   512     1 */
    
            /* XXX 3 bytes hole, try to pack */
    
            int                        core_waiters;         /*   516     4 */
            struct completion *        core_startup_done;    /*   520     4 */
            struct completion          core_done;            /*   524    52 */
            rwlock_t                   ioctx_list_lock;      /*   576    36 */
            struct kioctx *            ioctx_list;           /*   612     4 */
    }; /* size: 616, sum members: 613, holes: 1, sum holes: 3, cachelines: 20,
          last cacheline: 8 bytes */
    
    After:
    
    [acme@newtoy net-2.6.20]$ pahole --cacheline 32 kernel/sched.o mm_struct
    /* include2/asm/processor.h:542 */
    struct mm_struct {
            struct vm_area_struct *    mmap;                 /*     0     4 */
            struct rb_root             mm_rb;                /*     4     4 */
            struct vm_area_struct *    mmap_cache;           /*     8     4 */
            long unsigned int          (*get_unmapped_area)(); /*    12     4 */
            void                       (*unmap_area)();      /*    16     4 */
            long unsigned int          mmap_base;            /*    20     4 */
            long unsigned int          task_size;            /*    24     4 */
            long unsigned int          cached_hole_size;     /*    28     4 */
            /* ---------- cacheline 1 boundary ---------- */
            long unsigned int          free_area_cache;      /*    32     4 */
            pgd_t *                    pgd;                  /*    36     4 */
            atomic_t                   mm_users;             /*    40     4 */
            atomic_t                   mm_count;             /*    44     4 */
            int                        map_count;            /*    48     4 */
            struct rw_semaphore        mmap_sem;             /*    52    64 */
            spinlock_t                 page_table_lock;      /*   116    40 */
            struct list_head           mmlist;               /*   156     8 */
            mm_counter_t               _file_rss;            /*   164     4 */
            mm_counter_t               _anon_rss;            /*   168     4 */
            long unsigned int          hiwater_rss;          /*   172     4 */
            long unsigned int          hiwater_vm;           /*   176     4 */
            long unsigned int          total_vm;             /*   180     4 */
            long unsigned int          locked_vm;            /*   184     4 */
            long unsigned int          shared_vm;            /*   188     4 */
            /* ---------- cacheline 6 boundary ---------- */
            long unsigned int          exec_vm;              /*   192     4 */
            long unsigned int          stack_vm;             /*   196     4 */
            long unsigned int          reserved_vm;          /*   200     4 */
            long unsigned int          def_flags;            /*   204     4 */
            long unsigned int          nr_ptes;              /*   208     4 */
            long unsigned int          start_code;           /*   212     4 */
            long unsigned int          end_code;             /*   216     4 */
            long unsigned int          start_data;           /*   220     4 */
            /* ---------- cacheline 7 boundary ---------- */
            long unsigned int          end_data;             /*   224     4 */
            long unsigned int          start_brk;            /*   228     4 */
            long unsigned int          brk;                  /*   232     4 */
            long unsigned int          start_stack;          /*   236     4 */
            long unsigned int          arg_start;            /*   240     4 */
            long unsigned int          arg_end;              /*   244     4 */
            long unsigned int          env_start;            /*   248     4 */
            long unsigned int          env_end;              /*   252     4 */
            /* ---------- cacheline 8 boundary ---------- */
            long unsigned int          saved_auxv[44];       /*   256   176 */
            cpumask_t                  cpu_vm_mask;          /*   432     4 */
            mm_context_t               context;              /*   436    68 */
            long unsigned int          swap_token_time;      /*   504     4 */
            char                       recent_pagein;        /*   508     1 */
            unsigned char              dumpable:2;           /*   509     1 */
    
            /* XXX 2 bytes hole, try to pack */
    
            int                        core_waiters;         /*   512     4 */
            struct completion *        core_startup_done;    /*   516     4 */
            struct completion          core_done;            /*   520    52 */
            rwlock_t                   ioctx_list_lock;      /*   572    36 */
            struct kioctx *            ioctx_list;           /*   608     4 */
    }; /* size: 612, sum members: 610, holes: 1, sum holes: 2, cachelines: 20,
          last cacheline: 4 bytes */
    
    [acme@newtoy net-2.6.20]$ codiff -V /tmp/sched.o.before kernel/sched.o
    /pub/scm/linux/kernel/git/acme/net-2.6.20/kernel/sched.c:
      struct mm_struct |   -4
        dumpable:2;
         from: unsigned int          /*   432(30)    4(2) */
         to:   unsigned char         /*   509(6)     1(2) */
    < SNIP other offset changes >
     1 struct changed
    [acme@newtoy net-2.6.20]$
    
    I'm not aware of any problem about using 2 byte wide bitfields where
    previously a 4 byte wide one was, holler if there is any, I wouldn't be
    surprised, bitfields are things from hell.
    
    For the curious, 432(30) means: at offset 432 from the struct start, at
    offset 30 in the bitfield (yeah, it comes backwards, hellish, huh?) ditto
    for 509(6), while 4(2) and 1(2) means "struct field size(bitfield size)".
    
    Now we have a 2 bytes hole and are using only 4 bytes of the last 32
    bytes cacheline, any takers? :-)
    
    Signed-off-by: Arnaldo Carvalho de Melo <acme@mandriva.com>
    Signed-off-by: Andrew Morton <akpm@osdl.org>
    Signed-off-by: Linus Torvalds <torvalds@osdl.org>

commit 46ca5f5dc4f1c9b5ac02c0090ae8ff4ac8560446
Author: Arnaldo Carvalho de Melo <acme@mandriva.com>
Date:   Mon Nov 27 17:58:59 2006 -0200

    [XFRM]: Pack struct xfrm_policy
    
    [acme@newtoy net-2.6.20]$ pahole net/ipv4/tcp.o xfrm_policy
    /* /pub/scm/linux/kernel/git/acme/net-2.6.20/include/linux/security.h:67 */
    struct xfrm_policy {
            struct xfrm_policy *       next;                 /*     0     4 */
            struct hlist_node          bydst;                /*     4     8 */
            struct hlist_node          byidx;                /*    12     8 */
            rwlock_t                   lock;                 /*    20    36 */
            atomic_t                   refcnt;               /*    56     4 */
            struct timer_list          timer;                /*    60    24 */
            u8                         type;                 /*    84     1 */
    
            /* XXX 3 bytes hole, try to pack */
    
            u32                        priority;             /*    88     4 */
            u32                        index;                /*    92     4 */
            struct xfrm_selector       selector;             /*    96    56 */
            struct xfrm_lifetime_cfg   lft;                  /*   152    64 */
            struct xfrm_lifetime_cur   curlft;               /*   216    32 */
            struct dst_entry *         bundles;              /*   248     4 */
            __u16                      family;               /*   252     2 */
            __u8                       action;               /*   254     1 */
            __u8                       flags;                /*   255     1 */
            __u8                       dead;                 /*   256     1 */
            __u8                       xfrm_nr;              /*   257     1 */
    
            /* XXX 2 bytes hole, try to pack */
    
            struct xfrm_sec_ctx *      security;             /*   260     4 */
            struct xfrm_tmpl           xfrm_vec[6];          /*   264   360 */
    }; /* size: 624, sum members: 619, holes: 2, sum holes: 5 */
    
    So lets have just one hole instead of two, by moving 'type' to just before 'action',
    end result:
    
    [acme@newtoy net-2.6.20]$ codiff -s /tmp/tcp.o.before net/ipv4/tcp.o
    /pub/scm/linux/kernel/git/acme/net-2.6.20/net/ipv4/tcp.c:
      struct xfrm_policy |   -4
     1 struct changed
    [acme@newtoy net-2.6.20]$
    
    [acme@newtoy net-2.6.20]$ pahole -c 64 net/ipv4/tcp.o xfrm_policy
    /* /pub/scm/linux/kernel/git/acme/net-2.6.20/include/linux/security.h:67 */
    struct xfrm_policy {
            struct xfrm_policy *       next;                 /*     0     4 */
            struct hlist_node          bydst;                /*     4     8 */
            struct hlist_node          byidx;                /*    12     8 */
            rwlock_t                   lock;                 /*    20    36 */
            atomic_t                   refcnt;               /*    56     4 */
            struct timer_list          timer;                /*    60    24 */
            u32                        priority;             /*    84     4 */
            u32                        index;                /*    88     4 */
            struct xfrm_selector       selector;             /*    92    56 */
            struct xfrm_lifetime_cfg   lft;                  /*   148    64 */
            struct xfrm_lifetime_cur   curlft;               /*   212    32 */
            struct dst_entry *         bundles;              /*   244     4 */
            u16                        family;               /*   248     2 */
            u8                         type;                 /*   250     1 */
            u8                         action;               /*   251     1 */
            u8                         flags;                /*   252     1 */
            u8                         dead;                 /*   253     1 */
            u8                         xfrm_nr;              /*   254     1 */
    
            /* XXX 1 byte hole, try to pack */
    
            struct xfrm_sec_ctx *      security;             /*   256     4 */
            struct xfrm_tmpl           xfrm_vec[6];          /*   260   360 */
    }; /* size: 620, sum members: 619, holes: 1, sum holes: 1 */
    
    Are there any fugly data dependencies here? None that I know.
    
    In the process changed the removed the __ prefixed types, that are just for
    userspace visible headers.
    
    Signed-off-by: Arnaldo Carvalho de Melo <acme@mandriva.com>

commit d5c42c0ec4f7fd5a4e19e33a2d561758b67c55c8
Author: Arnaldo Carvalho de Melo <acme@mandriva.com>
Date:   Mon Nov 27 17:58:02 2006 -0200

    [NET]: Pack struct hh_cache
    
    [acme@newtoy net-2.6.20]$ pahole net/ipv4/tcp.o hh_cache
    /* /pub/scm/linux/kernel/git/acme/net-2.6.20/include/linux/netdevice.h:190 */
    struct hh_cache {
            struct hh_cache *          hh_next;              /*     0     4 */
            atomic_t                   hh_refcnt;            /*     4     4 */
            __be16                     hh_type;              /*     8     2 */
    
            /* XXX 2 bytes hole, try to pack */
    
            int                        hh_len;               /*    12     4 */
            int                        (*hh_output)();       /*    16     4 */
            rwlock_t                   hh_lock;              /*    20    36 */
            long unsigned int          hh_data[24];          /*    56    96 */
    }; /* size: 152, sum members: 150, holes: 1, sum holes: 2 */
    
    [acme@newtoy net-2.6.20]$ find net -name "*.[ch]" | xargs grep 'hh_len.\+=' | sort -u
    net/atm/br2684.c:               hh->hh_len = PADLEN + ETH_HLEN;
    net/ethernet/eth.c:     hh->hh_len = ETH_HLEN;
    net/ipv4/ipconfig.c:    int hh_len = LL_RESERVED_SPACE(dev);
    net/ipv4/ip_output.c:   hh_len = LL_RESERVED_SPACE(rt->u.dst.dev);
    net/ipv4/ip_output.c:   int hh_len = LL_RESERVED_SPACE(dev);
    net/ipv4/netfilter.c:   hh_len = (*pskb)->dst->dev->hard_header_len;
    net/ipv4/raw.c: hh_len = LL_RESERVED_SPACE(rt->u.dst.dev);
    net/ipv6/ip6_output.c:  hh_len = LL_RESERVED_SPACE(rt->u.dst.dev);
    net/ipv6/netfilter/ip6t_REJECT.c:       hh_len = (dst->dev->hard_header_len + 15)&~15;
    net/ipv6/raw.c: hh_len = LL_RESERVED_SPACE(rt->u.dst.dev);
    [acme@newtoy net-2.6.20]$
    
    [acme@newtoy net-2.6.20]$ find include -name "*.h" | xargs grep 'define ETH_HLEN'
    include/linux/if_ether.h:#define ETH_HLEN       14              /* Total octets in header.       */
    
            (((dev)->hard_header_len&~(HH_DATA_MOD - 1)) + HH_DATA_MOD)
    
    [acme@newtoy net-2.6.20]$ pahole net/ipv4/tcp.o net_device | grep hard_header_len
            short unsigned int         hard_header_len;      /*   106     2 */
    [acme@newtoy net-2.6.20]$
    
    So I think we're safe in turning hh_len an u16, end result:
    
    [acme@newtoy net-2.6.20]$ codiff -sV /tmp/tcp.o.before net/ipv4/tcp.o
    /pub/scm/linux/kernel/git/acme/net-2.6.20/net/ipv4/tcp.c:
      struct hh_cache |   -4
        hh_len;
         from: int                   /*    12(0)     4(0) */
         to:   u16                   /*    10(0)     2(0) */
     1 struct changed
    [acme@newtoy net-2.6.20]$
    
    Signed-off-by: Arnaldo Carvalho de Melo <acme@mandriva.com>

commit 9f50b93f066f8dc339de9b0eb78a22a75e6c8f8f
Author: Josh Triplett <josh@joshtriplett.org>
Date:   Fri Sep 29 02:00:59 2006 -0700

    [PATCH] Make spinlock/rwlock annotations more accurate by using parameters, not types
    
    The lock annotations used on spinlocks and rwlocks currently use
    __{acquires,releases}(spinlock_t) and __{acquires,releases}(rwlock_t),
    respectively.  This loses the information of which lock actually got
